<a href="https://colab.research.google.com/github/noushadkhan01/kansepur-flyash-project/blob/master/bill3/kansepur_bill3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [17]:
!git clone https://github.com/noushadkhan01/kansepur-flyash-project.git1qawq

Cloning into 'kansepur-flyash-project.git1qawq'...
fatal: could not read Username for 'https://github.com': No such device or address

In [0]:
import pandas as pd

In [19]:
%cd ./kansepur-flyash-project/bill3/

[Errno 2] No such file or directory: './kansepur-flyash-project/bill3/'
/content/kansepur-flyash-project/bill3

In [20]:
!ls

kansepur_bill3.ipynb  kansepur_bill3.xlsx

In [21]:
df = pd.read_excel('kansepur_bill3.xlsx', 'Sheet1')
df.head()

       S.No.       Date                Counts     Name  Quantity
0        1.0 2019-01-01                   1.0   toheed       486
1        2.0        NaT                   2.0    isran       470
2        3.0        NaT                   3.0    wajid       419
3        4.0        NaT                   4.0    aarif       416
4        5.0        NaT                   5.0  farookh       420

In [22]:
df.tail(2)

         S.No. Date                Counts    Name  Quantity
386      387.0  NaT                  34.0  haseen       496
387        NaN  NaT                   NaN     NaN    178428

In [23]:
df = df[:387]
df.tail(1)

         S.No. Date                Counts    Name  Quantity
386      387.0  NaT                  34.0  haseen       496

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 387 entries, 0 to 386
Data columns (total 5 columns):
    S.No.               387 non-null float64
Date                    12 non-null datetime64[ns]
              Counts    387 non-null float64
Name                    387 non-null object
Quantity                387 non-null int64
dtypes: datetime64[ns](1), float64(2), int64(1), object(1)
memory usage: 15.2+ KB

In [25]:
unique_dates = df.Date.unique()
unique_dates = pd.Series(unique_dates).dropna()
print(unique_dates)

0    2019-01-01
2    2019-01-04
3    2019-01-05
4    2019-01-06
5    2019-01-07
6    2019-01-08
7    2019-01-09
8    2019-01-10
9    2019-01-11
10   2019-01-12
11   2019-01-13
12   2019-01-14
dtype: datetime64[ns]

In [26]:
df.Date.nunique()

12

In [27]:
df.Date.value_counts()

2019-01-07    1
2019-01-10    1
2019-01-13    1
2019-01-05    1
2019-01-08    1
2019-01-11    1
2019-01-14    1
2019-01-06    1
2019-01-09    1
2019-01-12    1
2019-01-01    1
2019-01-04    1
Name: Date, dtype: int64

In [0]:
import numpy as np

### Fill Date

In [0]:
for n, i in enumerate(df.Date.values):
  if not pd.isnull(i):
    date = i
  else:
    df.iloc[n, 0] = date

In [30]:
df.head(2)

,S.No.,Date,Counts,Name,Quantity
0,1,2019-01-01,1.0,toheed,486
1,2019-01-01T00:00:00.000000000,NaT,2.0,isran,470

In [31]:
df.Name.unique()

array(['toheed', 'isran', 'wajid', 'aarif', 'farookh', 'shokeen',
       'gulfam', 'shabir', 'hasan', 'jabir', 'rafakat', 'safi',
       'mustakim', 'intazar', 'mehmood', 'rasid', 'haseen', 'aashu',
       'kayum'], dtype=object)

In [32]:
sum(df.Quantity)

178428

In [33]:
quantity_per_name = df.Name.value_counts()
quantity_per_name

mehmood     30
farookh     30
isran       30
hasan       27
jabir       27
mustakim    26
rafakat     25
wajid       24
shabir      23
toheed      22
aarif       20
intazar     19
rasid       18
shokeen     18
gulfam      16
haseen      15
aashu       14
kayum        2
safi         1
Name: Name, dtype: int64

### Counts per Date

In [34]:
df.isnull().sum()

    S.No.                 0
Date                    375
              Counts      0
Name                      0
Quantity                  0
dtype: int64

## unique feets per name

In [35]:
group = df.groupby(df.Name)
group

In [36]:
for i, j in group:
  print(i, j.Quantity.unique(), '\n')

aarif [416]

aashu [430]

farookh [420]

gulfam [500]

hasan [538 508]

haseen [496]

intazar [517]

isran [470]

jabir [419]

kayum [450]

mehmood [419 500 538 517 486 453 470 420 405]

mustakim [405]

rafakat [538]

rasid [410]

safi [368]

shabir [470]

shokeen [453]

toheed [486]

wajid [419]

# Diesel

In [37]:
diesel = pd.read_excel('kansepur_bill3.xlsx', 'Diesel')
diesel.head()

,Name,2019-01-01 00:00:00,2019-01-04 00:00:00,2019-01-05 00:00:00,2019-01-06 00:00:00,2019-01-07 00:00:00,2019-01-08 00:00:00,2019-01-09 00:00:00,2019-01-10 00:00:00,2019-01-11 00:00:00,2019-01-12 00:00:00,2019-01-13 00:00:00,2019-01-14 00:00:00,Total Diesel,Cash
0,aarif,1500.0,0.0,0.0,0.0,0.0,2000.0,1500.0,2000.0,2000.0,2000.0,2000.0,0,13000,NaN
1,aashu,0.0,0.0,0.0,0.0,0.0,0.0,2000.0,2000.0,2000.0,0.0,500.0,2000,8500,NaN
2,farookh,2000.0,0.0,2000.0,1500.0,1500.0,1500.0,1500.0,1500.0,1500.0,0.0,2000.0,2000,17000,NaN
3,gulfam,2000.0,2000.0,2000.0,2000.0,0.0,2000.0,2500.0,2000.0,0.0,2000.0,2000.0,2000,20500,NaN
4,hasan,2000.0,0.0,2000.0,2000.0,2000.0,2000.0,1500.0,2000.0,1910.0,0.0,2000.0,2000,19410,600.0

In [38]:
diesel.shape

(23, 15)

In [39]:
df.head(2)

,S.No.,Date,Counts,Name,Quantity
0,1,2019-01-01,1.0,toheed,486
1,2019-01-01T00:00:00.000000000,NaT,2.0,isran,470

# Total Quantity per name

In [0]:
name_groups = df.groupby('Name')
name_total_quantity = pd.DataFrame(columns = ['Name', 'Total Quantity'])
for i, j in name_groups:
  name_total_quantity = name_total_quantity.append({'Name':i, 'Total Quantity': sum(j.Quantity)}, ignore_index = True)
  
name_total_quantity.sort_values(by = ['Total Quantity'], ascending = False, inplace = True)

In [41]:
name_total_quantity

        Name Total Quantity
4      hasan          14496
7      isran          14100
10   mehmood          13976
12   rafakat          13450
2    farookh          12600
8      jabir          11313
15    shabir          10810
17    toheed          10692
11  mustakim          10530
18     wajid          10056
6    intazar           9823
0      aarif           8320
16   shokeen           8154
3     gulfam           8000
5     haseen           7440
13     rasid           7380
1      aashu           6020
9      kayum            900
14      safi            368

In [42]:
diesel.head(1)

,Name,2019-01-01 00:00:00,2019-01-04 00:00:00,2019-01-05 00:00:00,2019-01-06 00:00:00,2019-01-07 00:00:00,2019-01-08 00:00:00,2019-01-09 00:00:00,2019-01-10 00:00:00,2019-01-11 00:00:00,2019-01-12 00:00:00,2019-01-13 00:00:00,2019-01-14 00:00:00,Total Diesel,Cash
0,aarif,1500.0,0.0,0.0,0.0,0.0,2000.0,1500.0,2000.0,2000.0,2000.0,2000.0,0,13000,NaN

In [43]:
diesel = diesel[['Name', 'Total Diesel']]
diesel.sort_values(by = 'Total Diesel', ascending = False, inplace = True)
diesel

         Name  Total Diesel
22        NaN        365000
21    Zztotal        365000
11    poclain         48500
14  sabir jcb         47000
20     zzcash         28530
3      gulfam         20500
7       isran         20000
4       hasan         19410
8       jabir         18000
19      wajid         18000
2     farookh         17000
16     shabir         16000
18     toheed         15060
12    rafakat         14500
10   mustakim         13500
0       aarif         13000
17    shokeen         12000
13      rasid         11500
6     intazar         10500
5      haseen          9500
1       aashu          8500
15       safi          2000
9       kayum          2000

In [44]:
name_total_quantity.shape

(19, 2)

In [45]:
diesel.shape

(23, 2)

In [0]:
final = pd.DataFrame(columns = ['Name','Count' , 'Total Quantity', 'Amount', 'Diesel', 'Amount - Diesel','Balance(Amount - Diesel)'])
for i in range(len(name_total_quantity)):
  for j in range(len(diesel)):
    if name_total_quantity.Name[i] == diesel.Name[j]:
      final = final.append({'Name': diesel.Name[j],'Total Quantity':name_total_quantity['Total Quantity'][i] ,
                            'Count':quantity_per_name.get(diesel.Name[j]),
                            'Amount':name_total_quantity['Total Quantity'][i]*3,
                            'Diesel':diesel['Total Diesel'][j],
                            'Amount - Diesel':name_total_quantity['Total Quantity'][i]*3 - diesel['Total Diesel'][j],
                           'Balance(Amount - Diesel)': name_total_quantity['Total Quantity'][i]*3 - diesel['Total Diesel'][j]},
                           ignore_index = True)

In [47]:
final.sort_values(by = 'Total Quantity', ascending = False, inplace = True)
final

,Name,Count,Total Quantity,Amount,Diesel,Amount - Diesel,Balance(Amount - Diesel)
4,hasan,27,14496,43488,19410,24078,24078
7,isran,30,14100,42300,20000,22300,22300
11,rafakat,25,13450,40350,14500,25850,25850
2,farookh,30,12600,37800,17000,20800,20800
8,jabir,27,11313,33939,18000,15939,15939
14,shabir,23,10810,32430,16000,16430,16430
16,toheed,22,10692,32076,15060,17016,17016
10,mustakim,26,10530,31590,13500,18090,18090
17,wajid,24,10056,30168,18000,12168,12168
6,intazar,19,9823,29469,10500,18969,18969
0,aarif,20,8320,24960,13000,11960,11960
15,shokeen,18,8154,24462,12000,12462,12462
3,gulfam,16,8000,24000,20500,3500,3500
5,haseen,15,7440,22320,9500,12820,12820
12,rasid,18,7380,22140,11500,10640,10640
1,aashu,14,6020,18060,8500,9560,9560
9,kayum,2,900,2700,2000,700,700
13,safi,1,368,1104,2000,-896,-896

In [48]:
final.shape

(18, 7)

# Total payable

In [49]:
sum(final['Amount - Diesel'])

252386

# Total Diesel to peoples

In [50]:
sum(final['Diesel'])

240970